app/Controllers/PersonalController.php

        ];

        // Lista de armas/especialidades distintas para el filtro
        $armasRows = $this->model->db->table('personas')
            ->select('arma_especialidad')->distinct()
            ->where('arma_especialidad !=', '')
            ->where('activo', 1)
            ->orderBy('arma_especialidad', 'ASC')
            ->get()->getResultArray();
---
SELECT DISTINCT `arma_especialidad`
FROM `personas`
WHERE `arma_especialidad` != ''
AND `activo` = 1
ORDER BY `arma_especialidad` ASC