app/Models/PersonaModel.php

SELECT *
FROM `personas`
WHERE `dni` = '43557145'
AND `tipo` = 'cadete'
 LIMIT 1
UPDATE `personas` SET `dni` = '43557145', `apellido` = 'LÓPEZ ADRIEL JUAN', `nombre` = '-', `grado` = 'IIdo Año', `arma_especialidad` = '2da Ca I', `destino_interno` = 'SEGUnda Compañia de Infanteria', `tipo` = 'cadete', `updated_at` = '2026-05-01 10:27:04'
WHERE `personas`.`id` IN ('722')
---
    public function insertarOActualizar(array $data): int
    {
        $existente = $this->where('dni', $data['dni'])
                         ->where('tipo', $data['tipo'])
                         ->first();

        if ($existente) {
            $this->update($existente->id, $data);