app/Models/SancionModel.php

    public function registrarSancionCompleta(
        string $idCausante,
        string $idAutoridad,
        array  $datosInfraccion,
        string $tipoSancion,
        string $usuarioId
    ): array {
        $db = \Config\Database::connect();
        $db->transStart();

        try {
            $infraccionModel = new InfraccionModel();
            $infraccionModel->insert($datosInfraccion);
            $idInfraccion = $infraccionModel->getInsertID();

            $this->insert([
                'id_infraccion' => $idInfraccion,
                'id_causante'   => $idCausante ?: null,
                'id_autoridad'  => $idAutoridad ?: null,
                'tipo_sancion'  => $tipoSancion,
                'estado'        => 'activa',
                'created_by'    => $usuarioId,
            ]);
---
INSERT INTO `sanciones` (`id_infraccion`, `id_causante`, `id_autoridad`, `tipo_sancion`, `estado`, `created_by`, `created_at`, `updated_at`) VALUES (32, 722, 1300, 'cadetes', 'activa', 1, '2026-05-01 10:27:04', '2026-05-01 10:27:04')