app/Models/UsuarioModel.php

    public function autenticar(string $username, string $password): ?object
    {
        $usuario = $this->where('username', $username)->where('activo', 1)->first();
        if (!$usuario || !password_verify($password, $usuario->password_hash)) {
            return null;
        }
        try {
            $this->db->table($this->table)
                     ->where('id', $usuario->id)
                     ->update(['ultimo_acceso' => date('Y-m-d H:i:s')]);
---
SELECT *
FROM `usuarios`
WHERE `username` = 'admin'
AND `activo` = 1
 LIMIT 1
UPDATE `usuarios` SET `ultimo_acceso` = '2026-05-04 13:31:22'
WHERE `id` = '1'